#+BEGIN_COMMENT
.. title: Shortest Paths: Bellman-Ford
.. slug: shortest-paths-bellman-ford
.. date: 2022-04-27 18:25:23 UTC-07:00
.. tags: graphs,shortest paths,trees,algorithms,data structures
.. category: Graphs
.. link: 
.. description: The Bellman-Ford Algorithm for finding the shortest paths in a graph from a single source.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-5c26b1e3-5210-4b57-8434-5ba1c391eb23-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC

#+begin_src python :tangle ../bowling/data_structures/graphs/shortest_paths.py
<<constants>>


<<the-vertex>>

    <<vertex-representation>>


<<the-edge>>

    <<edge-representation>>


<<the-graph>>

    <<add-edge>>


<<initialize-single-source>>


<<relax>>
#+end_src
* Test It
#+begin_src python :results none
nodes = dict()
for label in "stxyz":
    nodes[label] = Vertex(label)

graph = Graph()
graph.add_edge(Edge(nodes["s"], nodes["t"], 6))
graph.add_edge(Edge(nodes["s"], nodes["y"], 7))
graph.add_edge(Edge(nodes["t"], nodes["x"], 5))
graph.add_edge(Edge(nodes["t"], nodes["y"], 8))
graph.add_edge(Edge(nodes["t"], nodes["z"], -4))
graph.add_edge(Edge(nodes["x"], nodes["t"], -2))
graph.add_edge(Edge(nodes["x"], nodes["t"], -2))
graph.add_edge(Edge(nodes["y"], nodes["x"], -3))
graph.add_edge(Edge(nodes["y"], nodes["z"], 9))
graph.add_edge(Edge(nodes["z"], nodes["x"], 7))
graph.add_edge(Edge(nodes["z"], nodes["s"], 2))

expect(bellman_ford(graph, nodes["s"])).to(be_true)
#+end_src

#+begin_src python :results output :exports both
pprint(nodes)

expected = (("s", 0, None),
            ("t", 2, "x"),
            ("x", 4, "y"),
            ("y", 7, "s"),
            ("z", -2, "t")
)

for node, path_weight, predecessor in expected:
    expect(nodes[node].path_estimate).to(equal(path_weight))
    parent = nodes[predecessor] if predecessor is not None else predecessor
    expect(nodes[node].predecessor).to(be(parent))
#+end_src

#+RESULTS:
: {'s': s (path-estimate=0),
:  't': t (path-estimate=2),
:  'x': x (path-estimate=4),
:  'y': y (path-estimate=7),
:  'z': z (path-estimate=-2)}
